data/perf/stageB-d3bf9f8c39fe/memcached-10k/tsan-st/run4/memtier.txt
10        Threads
50        Connections per thread
10000     Requests per client


BEST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       183716.35          ---          ---         4.03529         3.75900         9.98300        13.50300     12534.68 
Gets      1835144.66         0.00   1835144.66         3.95688         3.67900         9.79100        13.37500     46396.94 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    2018861.01         0.00   1835144.66         3.96402         3.69500         9.79100        13.37500     58931.62 


WORST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       174628.44          ---          ---         4.22853         3.95100        12.22300        17.91900     11914.63 
Gets      1744365.45         0.00   1744365.45         4.14658         3.87100        11.83900        17.40700     44101.82 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1918993.89         0.00   1744365.45         4.15404         3.87100        11.90300        17.40700     56016.44 


AGGREGATED AVERAGE RESULTS (5 runs)
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       180220.61          ---          ---         4.10839         3.82300        10.81500        15.23100     12296.17 
Gets      1800225.63         0.00   1800225.63         4.03094         3.75900        10.55900        14.97500     45514.10 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1980446.23         0.00   1800225.63         4.03799         3.75900        10.62300        15.03900     57810.27